In [31]:
import pandas as pd
import numpy as np
from  numpy.random import randn
np.random.seed(101)

df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['K','L','M','N'])
df

          K         L         M         N
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
print(df)
print(df<1)
boolean_df=df<1
print(boolean_df)
print(type(boolean_df))
df[boolean_df]
print(df[boolean_df])
print('*'*50)
print("we can combine above two options")
df[df<1]

          K         L         M         N
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
       K      L      M     N
A  False   True   True  True
B   True   True   True  True
C   True   True   True  True
D   True   True   True  True
E   True  False  False  True
       K      L      M     N
A  False   True   True  True
B   True   True   True  True
C   True   True   True  True
D   True   True   True  True
E   True  False  False  True
<class 'pandas.core.frame.DataFrame'>
          K         L         M         N
A       NaN  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794       NaN       NaN  0.683509
**************************************************
we can combine above two options

          K         L         M         N
A       NaN  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794       NaN       NaN  0.683509

In [13]:

boolean_df.dtypes

K    bool
L    bool
M    bool
N    bool
dtype: object

In [ ]:
boolean_df.applymap(type)

C:\Users\asus\AppData\Local\Temp\ipykernel_18516\1180327050.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  boolean_df.applymap(type)

                K               L               M               N
A  <class 'bool'>  <class 'bool'>  <class 'bool'>  <class 'bool'>
B  <class 'bool'>  <class 'bool'>  <class 'bool'>  <class 'bool'>
C  <class 'bool'>  <class 'bool'>  <class 'bool'>  <class 'bool'>
D  <class 'bool'>  <class 'bool'>  <class 'bool'>  <class 'bool'>
E  <class 'bool'>  <class 'bool'>  <class 'bool'>  <class 'bool'>

In [15]:
df.applymap(type)

C:\Users\asus\AppData\Local\Temp\ipykernel_18516\3828366062.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(type)

                 K                L                M                N
A  <class 'float'>  <class 'float'>  <class 'float'>  <class 'float'>
B  <class 'float'>  <class 'float'>  <class 'float'>  <class 'float'>
C  <class 'float'>  <class 'float'>  <class 'float'>  <class 'float'>
D  <class 'float'>  <class 'float'>  <class 'float'>  <class 'float'>
E  <class 'float'>  <class 'float'>  <class 'float'>  <class 'float'>

In [ ]:
print(df[df['K']>0]['M'])
print(df[df['K']<0][['M','N']])

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: M, dtype: float64
          M         N
C  0.528813 -0.589001

In [24]:
df[(df['K']>0) & (df['M']>0)]

          K         L         M         N
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.reset_index()

  index         K         L         M         N
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [26]:
print(df.reset_index())

  index         K         L         M         N
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          K         L         M         N
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.reset_index(inplace=True)

In [38]:
print(df)
print(df.loc['A'])
print(df.iloc[0])
print(df.loc['A','K'])
print(df.shape)
print(df.loc['A'])

          K         L         M         N
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
K    2.706850
L    0.628133
M    0.907969
N    0.503826
Name: A, dtype: float64
K    2.706850
L    0.628133
M    0.907969
N    0.503826
Name: A, dtype: float64
2.706849839399938
(5, 4)
K    2.706850
L    0.628133
M    0.907969
N    0.503826
Name: A, dtype: float64

In [37]:
df.loc['A','K']

np.float64(2.706849839399938)

In [40]:
import pandas
df=pandas.read_csv("video26_dataset_1.tsv",sep='\t')
print(df)
print(type(df))
print(df.shape)
print("df.columns:",df.columns)
print("type(df.columns):",type(df.columns))

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]
<class 'pandas.core.frame.DataFrame'>
(1704, 6)
df.columns: Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')
type(df.columns): <class 'pandas.core.indexes.base.Index'>

In [41]:
df.shape

(1704, 6)

In [42]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [43]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>